{
	"courses": [
	  {
		"id": 1,
		"title": "Monarchy in Austria: The Habsburgs",
		"section": "History",
		"duration": "3 hours",
		"image": "https://www.planet-wissen.de/geschichte/adel/geschichte_des_adels/tempxadelfrburggjpg102~_v-gseapremiumxl.jpg",
		"description": "The name Habsburg goes back to the village and the castle Habsburg in the Swiss Aargau. Here the Habsburgs had their ancestral seat in the 12th and 13th centuries and carried the family name Habsburg since the year 1108. It took only a few generations for the Habsburg family to significantly expand their territory and secure the German kingship in conjunction with the Roman emperorship. The Habsburgs were one of the most important ruling dynasties in Europe, whose influence extended over centuries. Their rule began in the 13th century and shaped the history of many European countries. The most important events include:",
		"events": [
		  {
			"title": "The Rise of the Habsburgs",
			"content": "In 1273, Rudolf I of Habsburg was elected King of the Holy Roman Empire. This marked the beginning of Habsburg rule. Rudolf used his power to consolidate the empire and strengthen his position."
		  },
		  {
			"title": "The Division of the Habsburgs",
			"content": "In 1379, the House of Habsburg was divided into two main lines: the Austrian and the Albertinian lines. This division led to internal conflicts and struggles for supremacy within the family."
		  },
		  {
			"title": "Maximilian I and Habsburg Marriage Policy",
			"content": "Maximilian I, one of the most famous Habsburgs, used skillful marriages to expand the power and influence of the family. Through his marriage to Mary of Burgundy, he acquired rich territories in the Netherlands."
		  },
		  {
			"title": "Charles V and the Challenge of the Reformation",
			"content": "Charles V, Emperor of the Holy Roman Empire, ruled over a vast empire that stretched from Spain through the Netherlands to Austria. During his reign, he had to deal with the Reformation initiated by Martin Luther."
		  },
		  {
			"title": "The Thirty Years' War and the Peace of Westphalia",
			"content": "The Thirty Years' War (1618-1648) was a devastating conflict in Central Europe, which had religious, political, and territorial causes. The Peace of Westphalia ended the war and led to significant changes in the political landscape of Europe."
		  },
		  {
			"title": "Maria Theresa and the Reforms",
			"content": "Maria Theresa, who ruled in the 18th century, carried out extensive reforms in administration, education, and the economy. She modernized the Habsburg Empire and strengthened her position as a ruler."
		  },
		  {
			"title": "The Decline of the Habsburgs",
			"content": "In the 19th century, the decline of the Habsburgs began. After World War I and the collapse of the Austro-Hungarian Monarchy in 1918, Habsburg rule ended definitively."
		  }
		],
		"video": "https://www.youtube.com/embed/teKkUP0ZkVA?rel=0&autoplay=0&showinfo=0&controls=1",
		"resources": [
		  {
			"title": "History of Hamburg",
			"url": "https://www.hamburg.com/residents/about/11853158/history/"
		  },
		  {
			"title": "The Habsburg monarchy – a simple introduction",
			"url": "https://www.visitingvienna.com/culture/habsburg-monarchy-introduction/"
		  }
		]
	},
    {
		"id": 2,
		"title": "Romeo and Juliet",
		"section": "Literature",
		"duration": "2 hours",
		"image": "https://cdn.britannica.com/90/84690-050-9A294C8B/Olivia-Hussey-Leonard-Whiting-Franco-Zeffirelli-Romeo.jpg",
		"description": "Romeo and Juliet is a tragedy written by William Shakespeare early in his career about two young star-crossed lovers whose deaths ultimately reconcile their feuding families. It was among Shakespeare's most popular plays during his lifetime and, along with Hamlet, is one of his most frequently performed plays. Today, the title characters are regarded as archetypal young lovers. The most important events in the play include:",
		"events": [
		  {
			"title": "The Capulet Ball",
			"content": "Romeo, a Montague, crashes the Capulet's party where he meets Juliet, and they instantly fall in love, despite the feud between their families."
		  },
		  {
			"title": "The Balcony Scene",
			"content": "Romeo sneaks into the Capulet orchard and overhears Juliet confessing her love for him. They exchange vows of love and plan to marry in secret."
		  },
		  {
			"title": "The Secret Marriage",
			"content": "Romeo and Juliet are married secretly by Friar Laurence, who hopes their union will end the feud between the Montagues and the Capulets."
		  },
		  {
			"title": "The Tragic Duel",
			"content": "Tybalt kills Mercutio, which leads to Romeo avenging his friend's death by killing Tybalt. As a result, Romeo is banished from Verona."
		  },
		  {
			"title": "The Potion Plan",
			"content": "Juliet and Friar Laurence concoct a plan to reunite her with Romeo. Juliet takes a potion that makes her appear dead, hoping Romeo will come to take her away once she wakes."
		  },
		  {
			"title": "The Final Tragedy",
			"content": "Romeo, believing Juliet is truly dead, takes his own life. When Juliet awakens and finds Romeo dead beside her, she also takes her own life."
		  }
		],
		"video": "https://www.youtube.com/embed/NlnGnCYK0mQ?rel=0&autoplay=0&showinfo=0&controls=1",
		"resources": [
		  {
			"title": "Shakespeare's Romeo and Juliet",
			"url": "https://www.sparknotes.com/shakespeare/romeojuliet/"
		  },
		  {
			"title": "Romeo and Juliet Full Text",
			"url": "https://www.opensourceshakespeare.org/views/plays/playmenu.php?WorkID=romeojuliet"
		}
	]
  },
  {
			"id": 3,
			"title": "The Four Seasons by Vivaldi",
			"section": "Music",
			"duration": "1.5 hours",
			"image": "https://f4.bcbits.com/img/a3777569265_65",
			"description": "The Four Seasons is a group of four violin concertos by Italian composer Antonio Vivaldi, each of which gives musical expression to a season of the year. They were composed around 1716-1717 and published in 1725. The most important parts of The Four Seasons include:",
			"events": [
			  {
				"title": "Spring",
				"content": "The first concerto in the set, Spring, is the best known. It evokes the season with sounds of birds, a murmuring brook, and gentle breezes."
			  },
			  {
				"title": "Summer",
				"content": "Summer is characterized by slower movements that represent the languid heat and faster passages that depict thunderstorms."
			  },
			  {
				"title": "Autumn",
				"content": "Autumn evokes the harvest season with festive dance movements and a depiction of a hunt with hunting horns."
			  },
			  {
				"title": "Winter",
				"content": "Winter features crisp, staccato notes that represent the cold and biting winds of the season."
			  }
			],
			"video": "https://www.youtube.com/embed/S5n7Jfa7Ryk?rel=0&autoplay=0&showinfo=0&controls=1",
			"resources": [
			  {
				"title": "The Four Seasons by Vivaldi",
				"url": "https://www.britannica.com/topic/The-Four-Seasons-by-Vivaldi"
			  },
			  {
				"title": "Vivaldi's Four Seasons Explained",
				"url": "https://www.classicfm.com/composers/vivaldi/guides/vivaldi-four-seasons/"
			}
		]
	  },
	  {
		"id": 4,
		"title": "The Nile River",
		"section": "Geography",
		"duration": "2 hours",
		"image": "https://assets.editorial.aetnd.com/uploads/2021/07/nile-river-gettyimages-1161692416.jpg",
		"description": "The Nile is a major north-flowing river in northeastern Africa, and is commonly regarded as the longest river in the world. It is about 6,650 km (4,130 mi) long and its drainage basin covers eleven countries. The most important aspects of the Nile River include:",
		"events": [
		  {
			"title": "Geography of the Nile",
			"content": "The Nile flows through northeastern Africa and is typically regarded as the longest river in the world. It runs through eleven countries: Tanzania, Uganda, Rwanda, Burundi, the Democratic Republic of the Congo, Kenya, Ethiopia, Eritrea, South Sudan, Sudan, and Egypt."
		  },
		  {
			"title": "Historical Significance",
			"content": "The Nile has been the lifeline of civilization in Egypt since the Stone Age. Its waters provided the ancient Egyptians with fertile land, transportation, and materials for building."
		  },
		  {
			"title": "The Nile Delta",
			"content": "The Nile Delta is one of the world's largest river deltas, stretching from Alexandria in the west to Port Said in the east. It is a rich agricultural region that has been farmed for thousands of years."
		  },
		  {
			"title": "The Aswan High Dam",
			"content": "The Aswan High Dam, completed in 1970, is one of the largest embankment dams in the world. It created Lake Nasser and has had a significant impact on the economy and agriculture of Egypt."
		  }
		],
		"video": "https://www.youtube.com/embed/aEK6PT7K8OM?rel=0&autoplay=0&showinfo=0&controls=1",
		"resources": [
		  {
			"title": "The Nile River",
			"url": "https://www.britannica.com/place/Nile-River"
		  },
		  {
			"title": "Nile River Facts",
			"url": "https://www.natgeokids.com/uk/discover/geography/physical-geography/nile-river-facts/"
		}
	]
  },
  {
	"id": 5,
	"title": "Ancient Greece",
	"section": "History",
	"duration": "3 hours",
	"image": "https://cdn.britannica.com/65/226765-138-BDEAEC84/Ancient-Greek-sports.jpg?w=800&h=450&c=crop",
	"description": "Ancient Greece is the civilization that emerged on the Greek peninsula and the islands of the Aegean Sea from around the 8th century BC to the end of antiquity (c. AD 600). Known for its rich contributions to art, philosophy, politics, and science, the period is marked by major historical events and figures. The most important aspects of Ancient Greece include:",
	"events": [
	  {
		"title": "The Birth of Democracy",
		"content": "In the 5th century BC, Athens developed the concept of democracy, where citizens had the right to vote on laws and policies. This was a radical departure from the monarchies and oligarchies that had previously dominated the region."
	  },
	  {
		"title": "The Persian Wars",
		"content": "The Persian Wars were a series of conflicts between Greece and the Persian Empire in the 5th century BC. Key battles included Marathon, Thermopylae, and Salamis, which highlighted Greek unity and military prowess."
	  },
	  {
		"title": "The Golden Age of Athens",
		"content": "The period following the Persian Wars saw a cultural and political flowering in Athens. This era produced great works of art, drama, and philosophy, and saw the construction of the Parthenon."
	  },
	  {
		"title": "The Peloponnesian War",
		"content": "The Peloponnesian War (431-404 BC) was a protracted conflict between Athens and Sparta, along with their respective allies. The war ultimately led to the downfall of Athens and the weakening of Greek states."
	  },
	  {
		"title": "Alexander the Great",
		"content": "In the 4th century BC, Alexander the Great of Macedon conquered a vast empire that stretched from Greece to Egypt and into northwest India. His conquests spread Greek culture and influence throughout the known world."
	  },
	  {
		"title": "The Hellenistic Period",
		"content": "Following Alexander's death, his empire fragmented into several Hellenistic kingdoms. This period saw the spread of Greek culture and the blending of Greek and Eastern influences in art, science, and governance."
	  }
	],
	"video": "https://www.youtube.com/embed/gFRxmi4uCGo?rel=0&autoplay=0&showinfo=0&controls=1",
	"resources": [
	  {
		"title": "History of Ancient Greece",
		"url": "https://www.history.com/topics/ancient-history/ancient-greece"
	  },
	  {
		"title": "Ancient Greece - The British Museum",
		"url": "https://www.britishmuseum.org/collection/galleries/ancient-greece"
	  }
	]
  },
  {
	"id": 6,
	"title": "Vincent van Gogh",
	"section": "Art",
	"duration": "2.5 hours",
	"image": "https://cdn.britannica.com/78/43678-050-F4DC8D93/Starry-Night-canvas-Vincent-van-Gogh-New-1889.jpg",
	"description": "Vincent van Gogh was a Dutch post-impressionist painter who created about 2,100 artworks, including around 860 oil paintings, most of which date from the last two years of his life. Known for his bold, dramatic brush strokes, his work helped lay the foundations of modern art. The most important aspects of Vincent van Gogh's life and work include:",
	"events": [
	  {
		"title": "Early Life and Struggles",
		"content": "Van Gogh was born in 1853 in the Netherlands. Despite showing early interest in art, he struggled with mental illness and poverty throughout his life."
	  },
	  {
		"title": "Paris and the Impressionists",
		"content": "In 1886, Van Gogh moved to Paris where he was influenced by the Impressionists and Post-Impressionists, including artists like Monet, Renoir, and Seurat."
	  },
	  {
		"title": "Arles and the Yellow House",
		"content": "In 1888, Van Gogh moved to Arles in the south of France, where he hoped to start an artist colony. He painted many of his most famous works here, including 'Sunflowers' and 'The Bedroom'."
	  },
	  {
		"title": "Mental Health and Hospitalization",
		"content": "Van Gogh's mental health deteriorated in Arles, leading to his hospitalization. During this period, he painted 'Starry Night', one of his most famous works."
	  },
	  {
		"title": "Final Years and Legacy",
		"content": "Van Gogh moved to Auvers-sur-Oise in 1890, where he continued to paint until his death. He died from a gunshot wound, widely believed to be self-inflicted. His work gained significant recognition posthumously, influencing countless artists and movements."
	  }
	],
	"video": "https://www.youtube.com/embed/wk9L1N9bRRE?rel=0&autoplay=0&showinfo=0&controls=1",
	"resources": [
	  {
		"title": "Vincent van Gogh - The Complete Works",
		"url": "https://www.vincentvangogh.org/"
	  },
	  {
		"title": "Van Gogh Museum - Amsterdam",
		"url": "https://www.vangoghmuseum.nl/en"
		}
	]
	},
	{
	"id": 7,
	"title": "World War I",
	"section": "History",
	"duration": "4 hours",
	"image": "https://cdn.britannica.com/72/157072-050-CC57C268/German-soldiers-gas-battlefields-World-War-I.jpg",
	"description": "World War I, also known as the Great War, was a global war originating in Europe that lasted from 28 July 1914 to 11 November 1918. Contemporaneously described as 'the war to end all wars', it led to the mobilization of more than 70 million military personnel, making it one of the largest wars in history. The most important aspects of World War I include:",
	"events": [
	{
		"title": "Assassination of Archduke Franz Ferdinand",
		"content": "The assassination of Archduke Franz Ferdinand of Austria in June 1914 led to a series of events that ultimately triggered World War I."
	},
	{
		"title": "The Western Front",
		"content": "The Western Front was the main theatre of war during World War I. It was characterized by trench warfare and saw significant battles such as the Battle of the Somme and the Battle of Verdun."
	},
	{
		"title": "The Eastern Front",
		"content": "The Eastern Front of World War I was a theatre of operations that encompassed at its greatest extent the entire frontier between the Russian Empire and Romania on one side and the Austro-Hungarian Empire, Bulgaria, the Ottoman Empire, and the German Empire on the other."
	},
	{
		"title": "The Home Front",
		"content": "The Home Front during World War I saw significant changes in society, including the role of women in the workforce and the introduction of rationing."
	},
	{
		"title": "The End of the War",
		"content": "The war ended on 11 November 1918, when an armistice was signed. The Treaty of Versailles, signed in 1919, formally ended the war and imposed heavy reparations and territorial losses on Germany."
	}
	],
	"video": "https://www.youtube.com/embed/_XPZQ0LAlR4?rel=0&autoplay=0&showinfo=0&controls=1",
	"resources": [
	{
		"title": "World War I - History",
		"url": "https://www.history.com/topics/world-war-i/world-war-i-history"
	},
	{
		"title": "World War I - National Archives",
		"url": "https://www.nationalarchives.gov.uk/pathways/firstworldwar/index.htm"
	}
	]
	},
	{
	"id": 8,
	"title": "Shakespeare's Life and Works",
	"section": "Literature",
	"duration": "3 hours",
	"image": "https://cdn.britannica.com/03/188603-050-9C9982C3/William-Shakespeare.jpg",
	"description": "William Shakespeare was an English playwright, poet, and actor, widely regarded as the greatest writer in the English language and the world's greatest dramatist. He is often called England's national poet and the 'Bard of Avon'. The most important aspects of Shakespeare's life and works include:",
	"events": [
	{
		"title": "Early Life",
		"content": "William Shakespeare was born in Stratford-upon-Avon in 1564. His exact birthdate is unknown, but it is traditionally observed on April 23."
	},
	{
		"title": "The Lost Years",
		"content": "The period between 1585 and 1592 is known as Shakespeare's 'lost years' because there are no records of his activities during this time."
	},
	{
		"title": "London and the Theatre",
		"content": "By 1592, Shakespeare had become an established actor and playwright in London. He was a member of the Lord Chamberlain's Men, later known as the King's Men."
	},
	{
		"title": "Major Works",
		"content": "Shakespeare wrote 39 plays, 154 sonnets, and two long narrative poems. His works include tragedies like 'Hamlet', 'Othello', 'King Lear', and 'Macbeth', comedies like 'A Midsummer Night's Dream' and 'Twelfth Night', and histories like 'Henry V' and 'Richard III'."
	},
	{
		"title": "Final Years",
		"content": "Shakespeare returned to Stratford in around 1613, where he lived until his death in 1616. He was buried in the Holy Trinity Church in Stratford-upon-Avon."
	}
	],
	"video": "https://www.youtube.com/embed/geev441vbMI?rel=0&autoplay=0&showinfo=0&controls=1",
	"resources": [
	{
		"title": "Shakespeare's Life",
		"url": "https://www.britannica.com/biography/William-Shakespeare"
	},
	{
		"title": "Shakespeare's Works",
		"url": "https://www.folger.edu/shakespeares-works"
	}
	]
	},
	{
	"id": 9,
	"title": "The Solar System",
	"section": "Astronomy",
	"duration": "2.5 hours",
	"image": "https://cdn.britannica.com/84/198584-050-C9C00B50/Solar-System-planets.jpg",
	"description": "The Solar System is the gravitationally bound system of the Sun and the objects that orbit it, either directly or indirectly. Of the objects that orbit the Sun directly, the largest are the eight planets, with the remainder being smaller objects, such as dwarf planets and small Solar System bodies. The most important aspects of the Solar System include:",
	"events": [
	{
		"title": "The Sun",
		"content": "The Sun is the star at the center of the Solar System. It is a nearly perfect sphere of hot plasma, and it accounts for about 99.86% of the total mass of the Solar System."
	},
	{
		"title": "The Inner Planets",
		"content": "The inner planets are Mercury, Venus, Earth, and Mars. These planets are primarily composed of rock and metal."
	},
	{
		"title": "The Outer Planets",
		"content": "The outer planets are Jupiter, Saturn, Uranus, and Neptune. These planets are significantly larger than the inner planets and are primarily composed of hydrogen, helium, and other gases."
	},
	{
		"title": "The Asteroid Belt",
		"content": "The asteroid belt is a region of the Solar System located between the orbits of Mars and Jupiter. It is home to a vast number of irregularly shaped bodies called asteroids or minor planets."
	},
	{
		"title": "Dwarf Planets",
		"content": "Dwarf planets are celestial bodies that orbit the Sun and have sufficient mass for their self-gravity to overcome rigid body forces, but have not cleared their neighboring region of other material. The most well-known dwarf planet is Pluto."
	}
	],
	"video": "https://www.youtube.com/embed/libKVRa01L8?rel=0&autoplay=0&showinfo=0&controls=1",
	"resources": [
	{
		"title": "The Solar System",
		"url": "https://www.nasa.gov/solar-system"
	},
	{
		"title": "The Solar System - National Geographic",
		"url": "https://www.nationalgeographic.com/science/space/solar-system/"
	}
	]
	},
	{
	"id": 10,
	"title": "The French Revolution",
	"section": "History",
	"duration": "3.5 hours",
	"image": "https://cdn.britannica.com/47/174847-050-68BCB2E2/French-Revolution-July-14-1789.jpg",
	"description": "The French Revolution was a period of far-reaching social and political upheaval in France and its colonies that lasted from 1789 until 1799. It was partially carried forward by Napoleon during the later expansion of the French Empire. The most important aspects of the French Revolution include:",
	"events": [
	{
		"title": "The Estates-General",
		"content": "The Estates-General of 1789 was a general assembly representing the French estates of the realm: the clergy, the nobility, and the commoners. It was the first meeting of the Estates-General since 1614."
	},
	{
		"title": "The Storming of the Bastille",
		"content": "The Storming of the Bastille on 14 July 1789 was a pivotal event in the French Revolution. The medieval fortress, armory, and political prison known as the Bastille represented royal authority in the center of Paris."
	},
	{
		"title": "The Reign of Terror",
		"content": "The Reign of Terror (1793-1794) was a period of the French Revolution characterized by a wave of executions of presumed enemies of the state. The guillotine became the symbol of the revolutionary cause."
	},
	{
		"title": "The Rise of Napoleon",
		"content": "Napoleon Bonaparte rose to prominence during the latter stages of the French Revolution. In 1799, he staged a coup d'état and established himself as the ruler of France."
	},
	{
		"title": "The Napoleonic Wars",
		"content": "The Napoleonic Wars (1803-1815) were a series of major conflicts pitting the French Empire and its allies, led by Napoleon I, against a fluctuating array of European powers formed into various coalitions."
	}
	],
	"video": "https://www.youtube.com/embed/wXsZbkt0yqo?rel=0&autoplay=0&showinfo=0&controls=1",
	"resources": [
	{
		"title": "The French Revolution",
		"url": "https://www.history.com/topics/france/french-revolution"
	},
	{
		"title": "The French Revolution - Britannica",
		"url": "https://www.britannica.com/event/French-Revolution"
	}
	]
	},
	{
	"id": 11,
	"title": "Artificial Intelligence",
	"section": "Technology",
	"duration": "3 hours",
	"image": "https://cdn.britannica.com/15/188115-050-BD9C59C0/robot-artificial-intelligence.jpg",
	"description": "Artificial Intelligence (AI) is the simulation of human intelligence in machines that are programmed to think and learn like humans. AI has numerous applications, including in areas such as robotics, natural language processing, and computer vision. The most important aspects of AI include:",
	"events": [
	{
		"title": "History of AI",
		"content": "The concept of AI has been around since ancient times, but modern AI began with the development of the first computers in the 1940s and 1950s. The term 'artificial intelligence' was coined in 1956 at the Dartmouth Conference."
	},
	{
		"title": "Machine Learning",
		"content": "Machine learning is a subset of AI that involves the use of algorithms and statistical models to allow computers to learn from data and make predictions or decisions without being explicitly programmed."
	},
	{
		"title": "Deep Learning",
		"content": "Deep learning is a subset of machine learning that uses neural networks with many layers (hence 'deep') to model complex patterns in data. It has led to significant advances in areas such as image and speech recognition."
	},
	{
		"title": "Applications of AI",
		"content": "AI has numerous applications, including in robotics (e.g., autonomous vehicles), natural language processing (e.g., chatbots), and computer vision (e.g., facial recognition)."
	},
	{
		"title": "Ethics of AI",
		"content": "The development and deployment of AI raise ethical concerns, including issues related to privacy, bias, and the potential impact on jobs and society. There is ongoing debate about how to ensure that AI is developed and used responsibly."
	}
	],
	"video": "https://www.youtube.com/embed/h0JykYXAh18?rel=0&autoplay=0&showinfo=0&controls=1",
	"resources": [
	{
		"title": "What is AI?",
		"url": "https://www.ibm.com/cloud/learn/what-is-artificial-intelligence"
	},
	{
		"title": "AI - Wikipedia",
		"url": "https://en.wikipedia.org/wiki/Artificial_intelligence"
	}
	]
	}
	]
	}